import React from "react";
import "./Terms.css";
import Footer from "../../components/Footer/Footer";
import usePageTitle from "../../hooks/usePageTitle";

function Terms() {
    usePageTitle("Умови використання");
    return (

        <>
            <section className="terms-page">
                <div className="terms-page__container">
                    <h1 className="terms-page__title">Умови використання</h1>

                    <p><strong>1. Загальні положення</strong></p>
                    <p>
                        Ці Умови використання регулюють порядок користування інтернет-магазином
                        <strong> Карпатські трави</strong> (далі — «Сайт»), який належить компанії, що реалізує натуральні
                        харчові добавки, БАДи та товари для здоров’я.
                    </p>

                    <p><strong>2. Прийняття умов</strong></p>
                    <p>
                        Користуючись Сайтом, ви підтверджуєте, що ознайомилися з цими Умовами
                        і згодні дотримуватись їх. Якщо ви не погоджуєтесь — будь ласка, не використовуйте Сайт.
                    </p>

                    <p><strong>3. Призначення продукції</strong></p>
                    <p>
                        Уся продукція, представлена на Сайті, є дієтичними добавками, а не лікарськими засобами.
                        Вони не призначені для діагностики, лікування чи профілактики захворювань.
                        Перед використанням рекомендується проконсультуватися з лікарем.
                    </p>

                    <p><strong>4. Замовлення та оплата</strong></p>
                    <p>
                        Користувач може оформити замовлення через Сайт, дотримуючись інструкцій.
                        Оплата здійснюється у зручний для клієнта спосіб, зазначений на сторінці оформлення замовлення.
                    </p>

                    <p><strong>5. Доставка</strong></p>
                    <p>
                        Доставка товарів здійснюється по території України згідно з обраним способом доставки.
                        Термін та вартість доставки залежать від обраного перевізника.
                        Адресна доставка безкоштовна від <strong>8000 </strong>грн !
                    </p>

                    <p><strong>6. Відповідальність</strong></p>
                    <p>
                        Компанія не несе відповідальності за неправильне використання продукції або її застосування
                        без дотримання рекомендацій. Відповідальність за вибір та використання товару несе користувач.
                    </p>

                    <p><strong>7. Повернення товарів</strong></p>
                    <p>
                        Повернення та обмін товарів здійснюється відповідно до чинного законодавства України.
                        Детальні умови повернення вказані у розділі «Повернення та обмін».
                    </p>

                    <p><strong>8. Зміни в умовах</strong></p>
                    <p>
                        Адміністрація Сайту залишає за собою право змінювати ці Умови без попереднього повідомлення.
                        Актуальна версія завжди доступна на сторінці «Умови використання».
                    </p>

                    <p><strong>9. Контакти</strong></p>
                    <p>
                        З усіх питань, пов’язаних із роботою Сайту чи цими Умовами, ви можете звертатися
                        за контактними даними, вказаними у розділі «Контакти».
                    </p>
                </div>
            </section>
            <Footer />
        </>

    );
}

export default Terms;
