import React from "react";
import "./Return.css";
import Footer from "../../components/Footer/Footer";
import usePageTitle from "../../hooks/usePageTitle";

function ReturnExchange() {
    usePageTitle("Повернення та обмін");

    return (
        <>
            <section className="return-page">
                <div className="return-page__container">
                    <h1 className="return-page__title">Повернення та обмін</h1>

                    <p>
                        Ми впевнені у якості нашої продукції, тому що виготовляємо її власноруч!
                        Якщо з якихось причин вам не підійшов товар належної якості, який підлягає поверненню або обміну,
                        ви можете зробити це протягом <strong>14 календарних днів</strong> з дати покупки, за умови що:
                    </p>

                    <ul>
                        <li>відсутні видимі пошкодження, що з’явилися в результаті використання;</li>
                        <li>товар упакований у фірмову упаковку з усіма етикетками та ярликами;</li>
                        <li>дотримані умови зберігання товару, збережені споживчі властивості;</li>
                        <li>збережений розрахунковий документ, виданий при покупці;</li>
                        <li>відсутні самостійно нанесені написи чи позначки на упаковці.</li>
                    </ul>

                    <p><strong>Повернення і обмін товарів неналежної якості</strong></p>
                    <p>
                        До товарів неналежної якості належать товари з виробничим браком.
                        Такий товар можна повернути або обміняти протягом усього терміну придатності,
                        якщо дефект виник не з вини покупця.
                        Також покупець має надати документ, що підтверджує покупку.
                    </p>
                    <p>
                        Якщо після отримання посилки ви виявили, що її вміст не відповідає замовленню
                        (за асортиментом, кількістю, комплектністю чи упаковкою),
                        ви можете повернути товар або частину замовлення протягом 14 календарних днів з дати покупки.
                    </p>

                    <p><strong>Процедура повернення / обміну товару</strong></p>
                    <p>
                        Для оформлення повернення або обміну необхідно протягом вказаного терміну
                        надіслати лист із темою <em>«Повернення (обмін) товару»</em> на пошту
                        <a href="mailto:tanusya09@gmail.com"> tanusya09@gmail.com</a>
                        або написати  за номером <strong>+38 (097) 134-57-97</strong>.
                    </p>
                    <p>У листі потрібно вказати:</p>
                    <ul>
                        <li>ПІБ покупця, адресу та телефон;</li>
                        <li>причину повернення або обміну;</li>
                        <li>фото або відео товару, який ви бажаєте повернути / обміняти;</li>
                        <li>копію розрахункового документа (чек або накладна);</li>
                        <li>ваше бажання — повернення чи обмін;</li>
                        <li>реквізити рахунку для повернення коштів (якщо потрібно).</li>
                    </ul>

                    <p>
                        Протягом 1 робочого дня після отримання листа наш менеджер зв’яжеться з вами
                        та повідомить адресу для відправки товару.
                    </p>

                    <p><strong>Доставка при поверненні</strong></p>
                    <p>
                        При поверненні або обміні товару належної якості доставку оплачує покупець.
                        Якщо ж товар має виробничий брак, доставку оплачує інтернет-магазин.
                    </p>

                    <p><strong>Повернення коштів</strong></p>
                    <p>
                        Після ухвалення рішення про повернення коштів вони перераховуються
                        на рахунок, зазначений покупцем у листі-запиті, протягом <strong>14 робочих днів</strong>.
                    </p>
                </div>

            </section>
            <Footer />

        </>
    );
}

export default ReturnExchange;
